/******************************************************Library******************************************************/

#include "Timers.h"

/******************************************************Use Function*************************************************/
void TIM1_Init(void) {

	/*************** Enable TIM1 (CH1) ***************/
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
	TIM1->CCER = 0;										// обнуляем CCER (выключаем каналы)
	TIM1->ARR = 1000; 									// максимальное значение, до которого таймер ведет счет
	TIM1->PSC = 48 - 1;                					// предделитель
	TIM1->BDTR |= TIM_BDTR_MOE;     					// Разрешаем вывод сигнала на выводы

	TIM1->CCR2 = 0; 									// задаем скважность в регистр сравнения канала (значения от 0 до TIM1->ARR)
	TIM1->CCMR1 |= TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2M_2; // Включаем канал в режим ШИМ
	TIM1->CCER |= (TIM_CCER_CC2P |TIM_CCER_CC2E); 		// Разрешаем вывод не инвертированного сигнала на ногу МК
														// для второго ШИМ-сигнала используем канал 3
	TIM1->CCR3 = 0; 									// задаем скважность в регистр сравнения канала (значения от 0 до TIM1->ARR)
	TIM1->CCMR2 |= TIM_CCMR2_OC3M_1 | TIM_CCMR2_OC3M_2; // Включаем канал в режим ШИМ
	TIM1->CCER |= TIM_CCER_CC3NE; 						// Разрешаем вывод не инвертированного сигнала на ногу МК
	TIM1->CCER &= ~TIM_CCER_CC3NP;

	TIM1->CR1 |= TIM_CR1_CEN;
}
